## select() Function from dplyr

In [ ]:
# select() is a function from dplyr R package that is used to select data frame variables by name, by index

    # Syntax of select()
    select(x, variables_to_select)

In [1]:
df <- data.frame(
  id = c(10,11,12,13),
  name = c('sai','ram','deepika','sahithi'),
  gender = c('M','M','F','F'),
  dob = as.Date(c('1990-10-02','1981-3-24','1987-6-14','1985-8-16')),
  state = c('CA','NY','DE',NA),
  row.names=c('r1','r2','r3','r4')
)

df

   id name    gender dob        state
r1 10 sai     M      1990-10-02 CA
r2 11 ram     M      1981-03-24 NY
r3 12 deepika F      1987-06-14 DE
r4 13 sahithi F      1985-08-16 NA

In [6]:
library('dplyr')

# Select Variables by Index Position

df %>% select(2,3)

   name    gender
r1 sai     M
r2 ram     M
r3 deepika F
r4 sahithi F

In [7]:
# Select columns by list of index or position

df %>% select(c(2,3))

   name    gender
r1 sai     M
r2 ram     M
r3 deepika F
r4 sahithi F

In [8]:
# Select columns by index range
df %>% select(2:3)

   name    gender
r1 sai     M
r2 ram     M
r3 deepika F
r4 sahithi F

In [9]:
# Select Variables by Name
df %>% select('name','gender')

   name    gender
r1 sai     M
r2 ram     M
r3 deepika F
r4 sahithi F

In [10]:
df %>% select(c('name','gender'))

   name    gender
r1 sai     M
r2 ram     M
r3 deepika F
r4 sahithi F

In [11]:
# Select All Variables Between 2 Variables

df %>% select('name':'state')

   name    gender dob        state
r1 sai     M      1990-10-02 CA
r2 ram     M      1981-03-24 NY
r3 deepika F      1987-06-14 DE
r4 sahithi F      1985-08-16 NA

In [12]:
# Select All Variables that starts with

df %>% select(starts_with('gen'))

   gender
r1 M
r2 M
r3 F
r4 F

In [13]:
# Select All Variables that ends with
df %>% select(ends_with('e'))

   name    state
r1 sai     CA
r2 ram     NY
r3 deepika DE
r4 sahithi NA

In [14]:
# Select Variables containing character

df %>% select(contains('a'))

   name    state
r1 sai     CA
r2 ram     NY
r3 deepika DE
r4 sahithi NA

In [15]:
# Select All Numeric Variables

df %>% select_if(is.numeric)

   id
r1 10
r2 11
r3 12
r4 13

In [17]:
# Use Select using negation
df %>% select(-c('name','gender'))

   id dob        state
r1 10 1990-10-02 CA
r2 11 1981-03-24 NY
r3 12 1987-06-14 DE
r4 13 1985-08-16 NA

In [18]:
# dplyr - Select columns not start with a string
df %>% select(-starts_with('gen'))

   id name    dob        state
r1 10 sai     1990-10-02 CA
r2 11 ram     1981-03-24 NY
r3 12 deepika 1987-06-14 DE
r4 13 sahithi 1985-08-16 NA

In [20]:
read.csv("sampledata\\vehicle.csv") -> data

In [22]:
data2 = data %>% 
          select(-starts_with("user."), -starts_with("milestone."), 
         -starts_with("pull_"), -ends_with("url"))

head(data2)

  Vehicle fm Mileage lh  lc     mc     State
1 1        0   863   1.1  66.30 697.23 MS
2 2       10  4644   2.4 233.03 119.66 CA
3 3       15 16330   4.2 325.08 175.46 WI
4 4        0    13   1.0  66.64   0.00 OR
5 5       13 22537   4.5 328.66 175.46 AZ
6 6       21 40931   3.1 205.28 175.46 FL